_site/notes/go.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Go</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge386d3d">New Project</a>
<ul>
<li><a href="#org4b70180">Repo Structure</a></li>
</ul>
</li>
<li><a href="#orgad22411">Cobra</a></li>
<li><a href="#orgb11b2b4">Docker</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orge386d3d" class="outline-2">
<h2 id="orge386d3d"><a href="#orge386d3d">New Project</a></h2>
<div class="outline-text-2" id="text-orge386d3d">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">projectName</span>=$(basename $(<span style="color: #c678dd;">pwd</span>))
go mod init github.com/cfclrk/$<span style="color: #dcaeea;">projectName</span>
go mod tidy
</pre>
</div>
</div>

<div id="outline-container-org4b70180" class="outline-3">
<h3 id="org4b70180"><a href="#org4b70180">Repo Structure</a></h3>
<div class="outline-text-3" id="text-org4b70180">
<p>
See: <a href="http://peter.bourgon.org/go-best-practices-2016/#repository-structure">http://peter.bourgon.org/go-best-practices-2016/#repository-structure</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgad22411" class="outline-2">
<h2 id="orgad22411"><a href="#orgad22411">Cobra</a></h2>
<div class="outline-text-2" id="text-orgad22411">
<p>
Create a new cobra project:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">projectName</span>=$(basename $(<span style="color: #c678dd;">pwd</span>))
cobra init --pkg-name github.com/cfclrk/$<span style="color: #dcaeea;">projectName</span>
rm LICENSE

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Remove all block comments (between /* and */) in each file</span>
sed -i <span style="color: #98be65;">""</span> <span style="color: #98be65;">'/\/\*/,/\*\//d'</span> main.go
sed -i <span style="color: #98be65;">""</span> <span style="color: #98be65;">'/\/\*/,/\*\//d'</span> cmd/root.go

go mod init github.com/cfclrk/$<span style="color: #dcaeea;">projectName</span>
go mod tidy
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
Your Cobra applicaton is ready at
/Users/chris.clark/Projects/use
</pre>
</div>
</div>

<div id="outline-container-orgb11b2b4" class="outline-2">
<h2 id="orgb11b2b4"><a href="#orgb11b2b4">Docker</a></h2>
<div class="outline-text-2" id="text-orgb11b2b4">
<p>
Run golang container for interactive use:
</p>

<div class="org-src-container">
<pre class="src src-sh">docker run -it --rm golang:1.16
</pre>
</div>

<p>
Mount current project in container:
</p>

<div class="org-src-container">
<pre class="src src-sh">docker run -it --rm <span style="color: #98be65;">\</span>
       --mount <span style="color: #dcaeea;">type</span>=bind,<span style="color: #dcaeea;">source</span>=(<span style="color: #c678dd;">pwd</span>),<span style="color: #dcaeea;">target</span>=/root/$(basename $(<span style="color: #c678dd;">pwd</span>)) <span style="color: #98be65;">\</span>
       golang:1.16
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
